[{"id":"fcTYvhokCkUWswyl","name":"Comment","slug":"comment","relativePathFromProjectRoot":"/tools/types/code-types/src/TsComment.ts","srcFileId":"/TsComment","operationFolderName":"code-types","relativeFilePathFromSrc":"/TsComment.ts","relativeOperationBasePathFromProjectRoot":"/tools/types/code-types","operationName":"code-types","comment":"comments are basically one-or-multi-line human content inside of typescript files, so it's a very important to do something useful with them.\n\nspecial line prefixes:\n- TODO:\n- DISCUSSION:\n- IDEA:\n- LATER:\n- NB:\n\nThe convention should be that single-line comments should start with that. This then becomes the type of the comment.\nYou can also put multiple prefixes at the start.\n\nExample:\n\n`// TODO: NB: this is a todo but its also important`\n\nMultiline comments can also have one or multiple types in their text, but they should not be split into multiple comments as the context could be needed some times.\n\n\n\nThere are also some other things comments can say about statements, but these should be inside the frontmatter, and are much more flexible.\n- classified[0-10] indicating level of classification. This way I can share subsets of the codebase, maybe...\n- privacy\n- ...?\n\nNB: with the current setup we can also parse `.md` files as being a TsComment, keep it that way!\n\nNB: comments are part of the code, so they should always be in English!","rawStatement":"export interface TsComment extends IndexId {\n  /**\n   * the content of the comment in markdown, without frontmatter\n   */\n  comment: Markdown;\n  /**\n   * parameters destructured from the frontmatter of the parsed markdown (if comment is not a oneliner, otherwise it'll be empty)\n   */\n  parameters: FrontMatter;\n  /**\n   * These are the type indicators that were found in this single or multiline comment. Can be multiple.\n   */\n  types: CommentType[];\n\n  /**\n   * first line of the comment\n   */\n  firstLine: number;\n  /**\n   * last line of the comment\n   */\n  lastLine: number;\n  /**\n   * statement name the comment belongs to\n   */\n  statementName?: string;\n  /**\n   * raw statement text the comment belongs to\n   */\n  rawStatement?: string;\n}","parameters":{},"types":["nb"],"firstLine":14,"lastLine":43}]