[{"id":"oVtGmTahwgNqyFyI","name":"Comment","slug":"comment","relativePathFromProjectRoot":"/tools/types/code-types/src/TsInterface.ts","srcFileId":"/TsInterface","operationFolderName":"code-types","relativeFilePathFromSrc":"/TsInterface.ts","relativeOperationBasePathFromProjectRoot":"/tools/types/code-types","operationName":"code-types","comment":"TODO: Just like parameters, this should be linted for. If you define an interface that's not declared here, that should ring a bell.","rawStatement":"export interface TsInterface extends IndexId {\n  type: TypeInfo;\n  /**\n   * jsdoc comment above the interface, if any\n   */\n  description?: Markdown;\n\n  commentsInside: TsComment[];\n\n  /**\n   * raw interface text, coming from ts-morph\n   */\n  rawText?: string;\n  /**\n   * if the interface extends anything, names will be specified here\n   */\n  extensions?: string[];\n\n  /**\n   * if true, this interface is marked as a db model, which means it will be included in the db function autocompletion so it's easy to store and fetch data in this format.\n   *\n   * is automatically set to true when indexing and when one of the following statements holds true\n   * - if the doc-comment contains frontmatter with `isDbModel` or `defaultDbStorageMethod` specified\n   * - if the interface last word is \"db\" or \"model\" and if there are minimum 2 words\n   * - if the interface extends some other special interface\n   */\n  isDbModel: boolean;\n  /**\n   * if this interface is a db model, you can also specify the default db storage method for it. You can do this by specifying it in the frontmatter of the doccomment of the interface.\n   *\n   * When storing something into the database, this value can be overwritten in your query configuration. When fetching something from the database, it will always try all methods (unless specified otherwise). The following strategies are available to store the data.\n   *\n   * jsonMultiple (default): stores the data in a json file which is an array of this data structure\n   *\n   * TODO: jsonSingle: stores the data in a json file which is of this data structure (single object)\n   *\n   * TODO: markdown: stores the data in a markdown file. Takes \"markdown\" or \"description\" parameter as the main markdown. The other parameters are stored as front-matter\n   *\n   * TODO: keyValueMarkdown: stores the data in key value markdown format. Still need to determine how and if this is possible. Probably only for very simple datamodels\n   *\n   * TODO: csv: stores the data in a csv file (only possible for flat object datastructures)\n   */\n  defaultDbStorageMethod?: DbStorageMethod;\n}","parameters":{},"types":["todo"],"firstLine":7,"lastLine":10},{"id":"oVtGmTahwgNqyFyI","name":"Comment","slug":"comment","relativePathFromProjectRoot":"/tools/types/code-types/src/TsInterface.ts","srcFileId":"/TsInterface","operationFolderName":"code-types","relativeFilePathFromSrc":"/TsInterface.ts","relativeOperationBasePathFromProjectRoot":"/tools/types/code-types","operationName":"code-types","comment":"at some point in processing we need this interface where definition can also be null","rawStatement":"export type MaybeInteface = TsInterface & {\n  type: TypeInfo & { typeDefinition: Schema | null | undefined };\n};","parameters":{},"types":[],"firstLine":56,"lastLine":58}]